# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed()
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [3]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [4]:
df

          W         X         Y         Z
A -1.001670 -0.192180  0.184692 -1.549988
B  0.765852  0.809106 -0.464976  0.113886
C  0.396865  0.411330  1.489464  0.344489
D  0.059957 -1.845447  0.796418  0.662339
E  1.277809  0.100992  0.321181 -1.108456

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [5]:
df['W'][0]

-1.001669605808613

In [6]:
# Pass a list of column names
df[['W','Z']]
#df.W

          W         Z
A -1.001670 -1.549988
B  0.765852  0.113886
C  0.396865  0.344489
D  0.059957  0.662339
E  1.277809 -1.108456

In [7]:
# SQL Syntax (NOT RECOMMENDED!)
df.W #not good for columns having space in their name

A   -1.001670
B    0.765852
C    0.396865
D    0.059957
E    1.277809
Name: W, dtype: float64

DataFrame Columns are just Series

In [8]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [9]:
df['new'] = df['W'] + df['Y']

In [10]:
df

          W         X         Y         Z       new
A -1.001670 -0.192180  0.184692 -1.549988 -0.816977
B  0.765852  0.809106 -0.464976  0.113886  0.300876
C  0.396865  0.411330  1.489464  0.344489  1.886329
D  0.059957 -1.845447  0.796418  0.662339  0.856375
E  1.277809  0.100992  0.321181 -1.108456  1.598989

** Removing Columns**

In [11]:
df.drop('new',axis=1,errors='ignore')

          W         X         Y         Z
A -1.001670 -0.192180  0.184692 -1.549988
B  0.765852  0.809106 -0.464976  0.113886
C  0.396865  0.411330  1.489464  0.344489
D  0.059957 -1.845447  0.796418  0.662339
E  1.277809  0.100992  0.321181 -1.108456

In [12]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A -1.001670 -0.192180  0.184692 -1.549988 -0.816977
B  0.765852  0.809106 -0.464976  0.113886  0.300876
C  0.396865  0.411330  1.489464  0.344489  1.886329
D  0.059957 -1.845447  0.796418  0.662339  0.856375
E  1.277809  0.100992  0.321181 -1.108456  1.598989

In [13]:
df.drop('new',axis=1,inplace=True)

In [14]:
df

          W         X         Y         Z
A -1.001670 -0.192180  0.184692 -1.549988
B  0.765852  0.809106 -0.464976  0.113886
C  0.396865  0.411330  1.489464  0.344489
D  0.059957 -1.845447  0.796418  0.662339
E  1.277809  0.100992  0.321181 -1.108456

Can also drop rows this way:

In [15]:
df.drop('E')

          W         X         Y         Z
A -1.001670 -0.192180  0.184692 -1.549988
B  0.765852  0.809106 -0.464976  0.113886
C  0.396865  0.411330  1.489464  0.344489
D  0.059957 -1.845447  0.796418  0.662339

In [16]:
df

          W         X         Y         Z
A -1.001670 -0.192180  0.184692 -1.549988
B  0.765852  0.809106 -0.464976  0.113886
C  0.396865  0.411330  1.489464  0.344489
D  0.059957 -1.845447  0.796418  0.662339
E  1.277809  0.100992  0.321181 -1.108456

** Selecting Rows**

In [17]:
df.loc['A']

W   -1.001670
X   -0.192180
Y    0.184692
Z   -1.549988
Name: A, dtype: float64

In [18]:
df.iloc[0]

W   -1.001670
X   -0.192180
Y    0.184692
Z   -1.549988
Name: A, dtype: float64

In [19]:
len(df)

5

In [20]:
df

          W         X         Y         Z
A -1.001670 -0.192180  0.184692 -1.549988
B  0.765852  0.809106 -0.464976  0.113886
C  0.396865  0.411330  1.489464  0.344489
D  0.059957 -1.845447  0.796418  0.662339
E  1.277809  0.100992  0.321181 -1.108456

In [21]:
for i in range(len(df)):
    print(df.iloc[i])

W   -1.001670
X   -0.192180
Y    0.184692
Z   -1.549988
Name: A, dtype: float64
W    0.765852
X    0.809106
Y   -0.464976
Z    0.113886
Name: B, dtype: float64
W    0.396865
X    0.411330
Y    1.489464
Z    0.344489
Name: C, dtype: float64
W    0.059957
X   -1.845447
Y    0.796418
Z    0.662339
Name: D, dtype: float64
W    1.277809
X    0.100992
Y    0.321181
Z   -1.108456
Name: E, dtype: float64

Or select based off of position instead of label

In [22]:
df.iloc[2]

W    0.396865
X    0.411330
Y    1.489464
Z    0.344489
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [23]:
df

          W         X         Y         Z
A -1.001670 -0.192180  0.184692 -1.549988
B  0.765852  0.809106 -0.464976  0.113886
C  0.396865  0.411330  1.489464  0.344489
D  0.059957 -1.845447  0.796418  0.662339
E  1.277809  0.100992  0.321181 -1.108456

In [24]:
df.loc['B','Y']

-0.4649757691547267

In [25]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -1.001670  0.184692
B  0.765852 -0.464976

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [26]:
df

          W         X         Y         Z
A -1.001670 -0.192180  0.184692 -1.549988
B  0.765852  0.809106 -0.464976  0.113886
C  0.396865  0.411330  1.489464  0.344489
D  0.059957 -1.845447  0.796418  0.662339
E  1.277809  0.100992  0.321181 -1.108456

In [27]:
df>0

       W      X      Y      Z
A  False  False   True  False
B   True   True  False   True
C   True   True   True   True
D   True  False   True   True
E   True   True   True  False

In [28]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN  0.184692       NaN
B  0.765852  0.809106       NaN  0.113886
C  0.396865  0.411330  1.489464  0.344489
D  0.059957       NaN  0.796418  0.662339
E  1.277809  0.100992  0.321181       NaN

In [29]:
df[df['X']>0]

          W         X         Y         Z
B  0.765852  0.809106 -0.464976  0.113886
C  0.396865  0.411330  1.489464  0.344489
E  1.277809  0.100992  0.321181 -1.108456

In [30]:
df

          W         X         Y         Z
A -1.001670 -0.192180  0.184692 -1.549988
B  0.765852  0.809106 -0.464976  0.113886
C  0.396865  0.411330  1.489464  0.344489
D  0.059957 -1.845447  0.796418  0.662339
E  1.277809  0.100992  0.321181 -1.108456

In [31]:
df[df['W']>0]

          W         X         Y         Z
B  0.765852  0.809106 -0.464976  0.113886
C  0.396865  0.411330  1.489464  0.344489
D  0.059957 -1.845447  0.796418  0.662339
E  1.277809  0.100992  0.321181 -1.108456

In [32]:
df[df['W']>0]['Y']

B   -0.464976
C    1.489464
D    0.796418
E    0.321181
Name: Y, dtype: float64

In [33]:
df[df['W']>0][['Y','X']]

          Y         X
B -0.464976  0.809106
C  1.489464  0.411330
D  0.796418 -1.845447
E  0.321181  0.100992

In [34]:
df

          W         X         Y         Z
A -1.001670 -0.192180  0.184692 -1.549988
B  0.765852  0.809106 -0.464976  0.113886
C  0.396865  0.411330  1.489464  0.344489
D  0.059957 -1.845447  0.796418  0.662339
E  1.277809  0.100992  0.321181 -1.108456

For two conditions you can use | and & with parenthesis:

In [35]:
df[(df['W']>0) & (df['Y'] > 1)]

          W        X         Y         Z
C  0.396865  0.41133  1.489464  0.344489

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [36]:
df

          W         X         Y         Z
A -1.001670 -0.192180  0.184692 -1.549988
B  0.765852  0.809106 -0.464976  0.113886
C  0.396865  0.411330  1.489464  0.344489
D  0.059957 -1.845447  0.796418  0.662339
E  1.277809  0.100992  0.321181 -1.108456

In [38]:
# Reset to default 0,1...n index
df.drop(["index","level_0"], axis=1, inplace=True)

KeyError: "['index' 'level_0'] not found in axis"

In [39]:
df

          W         X         Y         Z
A -1.001670 -0.192180  0.184692 -1.549988
B  0.765852  0.809106 -0.464976  0.113886
C  0.396865  0.411330  1.489464  0.344489
D  0.059957 -1.845447  0.796418  0.662339
E  1.277809  0.100992  0.321181 -1.108456

In [40]:
newind = 'CA NY WY OR CO'.split()

In [41]:
df['States'] = newind

In [42]:
df

          W         X         Y         Z States
A -1.001670 -0.192180  0.184692 -1.549988     CA
B  0.765852  0.809106 -0.464976  0.113886     NY
C  0.396865  0.411330  1.489464  0.344489     WY
D  0.059957 -1.845447  0.796418  0.662339     OR
E  1.277809  0.100992  0.321181 -1.108456     CO

In [43]:
df.set_index('States')

               W         X         Y         Z
States
CA     -1.001670 -0.192180  0.184692 -1.549988
NY      0.765852  0.809106 -0.464976  0.113886
WY      0.396865  0.411330  1.489464  0.344489
OR      0.059957 -1.845447  0.796418  0.662339
CO      1.277809  0.100992  0.321181 -1.108456

In [44]:
df

          W         X         Y         Z States
A -1.001670 -0.192180  0.184692 -1.549988     CA
B  0.765852  0.809106 -0.464976  0.113886     NY
C  0.396865  0.411330  1.489464  0.344489     WY
D  0.059957 -1.845447  0.796418  0.662339     OR
E  1.277809  0.100992  0.321181 -1.108456     CO

In [45]:
df.set_index('States',inplace=True)

In [46]:
df

               W         X         Y         Z
States
CA     -1.001670 -0.192180  0.184692 -1.549988
NY      0.765852  0.809106 -0.464976  0.113886
WY      0.396865  0.411330  1.489464  0.344489
OR      0.059957 -1.845447  0.796418  0.662339
CO      1.277809  0.100992  0.321181 -1.108456

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [47]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [48]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [51]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.530283 -0.493921
   2 -0.257758  1.259806
   3 -0.451246 -0.610190
G2 1  0.973169 -1.882351
   2 -0.520122 -0.897409
   3 -0.549706 -1.118354

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [52]:
type(df.loc['G1'])
df.loc['G1']

          A         B
1  0.530283 -0.493921
2 -0.257758  1.259806
3 -0.451246 -0.610190

In [53]:
df.loc['G1'].loc[1]

A    0.530283
B   -0.493921
Name: 1, dtype: float64

In [54]:
df.index.names

FrozenList([None, None])

In [55]:
df.index.names = ['Group','Num']

In [56]:
df

                  A         B
Group Num
G1    1    0.530283 -0.493921
      2   -0.257758  1.259806
      3   -0.451246 -0.610190
G2    1    0.973169 -1.882351
      2   -0.520122 -0.897409
      3   -0.549706 -1.118354

In [57]:
df.xs('G1')

            A         B
Num
1    0.530283 -0.493921
2   -0.257758  1.259806
3   -0.451246 -0.610190

In [58]:
df.xs(['G1',1])

A    0.530283
B   -0.493921
Name: (G1, 1), dtype: float64

In [59]:
df.xs(1,level='Num')

              A         B
Group
G1     0.530283 -0.493921
G2     0.973169 -1.882351

In [ ]:
a=list(zip([1,2,3],[4,5,6]))

In [ ]:
a

In [ ]:
l1=[]
l2=[]
for i in a:
    l1.append(i[0])
    l2.append(i[1])

In [ ]:
df.iloc[[0,1,4],[0]]

In [ ]:
df